
### :robot: Terraform Report
---
##### Plan: `2` to add, `1` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.argocd[0] will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "7.6.12"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.traefik[0] will be updated in-place
  ~ resource "helm_release" "traefik" {
        id                         = "traefik"
      ~ metadata                   = [
          - {
              - app_version    = "v3.1.6"
              - chart          = "traefik"
              - first_deployed = 1729722314
              - last_deployed  = 1729722314
              - name           = "traefik"
              - namespace      = "traefik"
              - notes          = <<-EOT
                    traefik with docker.io/traefik:v3.1.6 has been deployed successfully on traefik namespace !
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - additionalArguments = [
                          - "--serversTransport.insecureSkipVerify=true",
                          - "--log.level=INFO",
                        ]
                      - deployment          = {
                          - replicas = 3
                        }
                      - globalArguments     = [
                          - "--global.sendanonymoususage=false",
                          - "--global.checknewversion=false",
                        ]
                      - ingressClass        = {
                          - name = "traefik-external"
                        }
                      - ingressRoute        = {
                          - dashboard = {
                              - enabled = false
                            }
                        }
                      - ports               = {
                          - web       = {
                              - redirectTo = {
                                  - port = "websecure"
                                }
                            }
                          - websecure = {
                              - tls = {
                                  - enabled = true
                                }
                            }
                        }
                      - providers           = {
                          - kubernetesCRD     = {
                              - enabled = true
                            }
                          - kubernetesIngress = {
                              - enabled          = true
                              - publishedService = {
                                  - enabled = true
                                }
                            }
                        }
                      - service             = {
                          - enabled = true
                          - type    = "LoadBalancer"
                        }
                    }
                )
              - version        = "32.1.1"
            },
        ] -> (known after apply)
        name                       = "traefik"
      ~ values                     = [
          - <<-EOT
                globalArguments:
                  - "--global.sendanonymoususage=false"
                  - "--global.checknewversion=false"
                
                additionalArguments:
                  - "--serversTransport.insecureSkipVerify=true"
                  - "--log.level=INFO"
                
                deployment:
                  replicas: 3
                
                ports:
                  web:
                    redirectTo:
                      port: websecure
                  websecure:
                    tls:
                      enabled: true
                      
                ingressRoute:
                  dashboard:
                    enabled: false
                
                providers:
                  kubernetesCRD:
                    enabled: true
                  kubernetesIngress:
                    enabled: true
                    publishedService:
                      enabled: true
                
                service:
                  enabled: true
                  type: LoadBalancer
            EOT,
          + <<-EOT
                globalArguments:
                  - "--global.sendanonymoususage=false"
                  - "--global.checknewversion=false"
                
                additionalArguments:
                  - "--serversTransport.insecureSkipVerify=true"
                  - "--log.level=INFO"
                
                deployment:
                  enabled: true
                  replicas: 3
                  annotations: {}
                  podAnnotations: {}
                  additionalContainers: []
                  initContainers: []
                
                ports:
                  web:
                    redirectTo:
                      port: websecure
                  websecure:
                    tls:
                      enabled: true
                      
                ingressRoute:
                  dashboard:
                    enabled: false
                
                providers:
                  kubernetesCRD:
                    enabled: true
                    ingressClass: traefik-external
                  kubernetesIngress:
                    enabled: true
                    publishedService:
                      enabled: true
                
                rbac:
                  enabled: true
                
                service:
                  enabled: true
                  type: LoadBalancer
                  annotations: {}
                  labels: {}
                  loadBalancerSourceRanges: []
                  externalIPs: []
            EOT,
        ]
        # (26 unchanged attributes hidden)

      - set {
          - name  = "ingressClass.name" -> null
          - value = "traefik-external" -> null
        }
    }

  # kubernetes_namespace.namespace-argocd will be created
  + resource "kubernetes_namespace" "namespace-argocd" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "istio-injection" = "enabled"
            }
          + name             = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11490396253`](https://github.com/innovats-hub/system-apps-aks/actions/runs/11490396253) - commit 0ce5b07ca4139be782be19e2e4678f0d820f724d
